app/controllers/seeds_controller.rb

  def index

  if params[:search]
    search = params[:search]
    @seeds = Seed.where('gid = ?', "#{search}")
  else
    @seeds = Seed.all
---
SELECT  "seeds".* FROM "seeds" WHERE "seeds"."id" = $1 LIMIT 1  [["id", nil]]
SELECT "seeds".* FROM "seeds"

  def create
    @seed = Seed.new(seed_params)

    respond_to do |format|
      if @seed.save
---
INSERT INTO "seeds" ("gid", "location", "room", "row", "shelf", "box", "stock_id", "source", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

    def set_seed
      @seed = Seed.find(params[:id])
---
SELECT  "seeds".* FROM "seeds" WHERE "seeds"."id" = $1 LIMIT 1  [["id", 1]]